[
  {
  "id": 2,
  "month": "Sept",
  "year": "2022",
  "title": "Hitch Hacker Guide to Computer Science",
  "description": "This comprehensive guide covers fundamental concepts such as algorithms and data structures, delves into emerging technologies like artificial intelligence and cybersecurity, and highlights various career paths and educational resources. Whether you're a student, educator, or enthusiast, this presentation provides a clear and engaging introduction to the world of computer science, making it an excellent addition to your educational website. You can access the presentation.",
  "link" : "https://shorturl.at/tjVj9"
  },
  {
  "id": 4,
  "month": "Oct",
  "year": "2023",
  "title": "Internship Conversations",
  "description": "This ACM Club presentation guided students through the process of creating a personal portfolio website hosted by Gettysburg College. It covered using MobaxTerm, SSH, and campus resources to set up and manage a public_html directory, ensuring files are properly accessible.",
  "link" : "https://shorturl.at/1MZaE"
  },
  {
  "id": 1,
  "month": "Sept",
  "year": "2022",
  "title": "Career Engagement Colloquium Takeaways",
  "description": "This presentation provided key takeaways from the Career Engagement Colloquium, covering resume building, networking, and interviewing strategies. It emphasized the importance of showcasing technical skills, leveraging platforms like LinkedIn and GitHub, utilizing various job search tools, and preparing effectively for interviews using the B.A.R. method.",
  "link" : "https://shorturl.at/908ST"
  },
  {
  "id": 3,
  "month": "Feb",
  "year": "2023",
  "title": "Creating a Portfolio",
  "description": "This presentation guided students through the process of creating a personal portfolio website hosted by Gettysburg College. It covered using MobaxTerm, SSH, and campus resources to set up and manage a public_html directory, ensuring files are properly accessible. The session also introduced alternative hosting options and best practices for structuring a professional online presence.",
  "link" : "https://shorturl.at/bsS9e"
  }
  ]